In [3]:
import numpy as np
import pandas as pd

In [ ]:
a = np.array([1,2,3,4])
print(a)
ds = pd.Series([1,2,3,4])
print(ds)

In [ ]:
prices_ds = pd.Series([1.5, 2, 2.5, 3],
            index=["apples", "oranges", "bananas", "strawberries"])
prices_ds

In [ ]:
s1 = pd.Series({
    'apples': 1.5,
    'oranges':2,
    'bananas':2.5
})
s1

In [ ]:
print( s1['oranges'])

### Series slicing

In [ ]:
s = pd.Series(np.arange(1,11))
s

In [ ]:
s[  [1,3,8]   ]

In [ ]:
s[ 1::2 ]

In [ ]:
# TODO: 'in' in data, not keys
4 in s

### DataFrame

In [ ]:
# from series

# by dictionary
s1 = pd.Series({
    'a':1,
    'c':3
})

# by list:
s1 = pd.Series( [1,3], index=['a','c'] )

s1

In [ ]:
df = pd.DataFrame( s1, columns=['A'] )
df

In [ ]:
lyuba_df = pd.read_excel('../data/29.1.xlsx')

In [7]:
titanic_df = pd.read_csv('../../datasets/train_and_test2.csv')

In [15]:
titanic_df.head(2)

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
0,1,22.0,7.2500,0,1,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1,2,38.0,71.2833,1,1,0,0,0,0,0,...,0,0,0,1,0,0,0.0,0,0,1

In [19]:
titanic_df.columns

Index(['Passengerid', 'Age', 'Fare', 'Sex', 'sibsp', 'zero', 'zero.1',
       'zero.2', 'zero.3', 'zero.4', 'zero.5', 'zero.6', 'Parch', 'zero.7',
       'zero.8', 'zero.9', 'zero.10', 'zero.11', 'zero.12', 'zero.13',
       'zero.14', 'Pclass', 'zero.15', 'zero.16', 'Embarked', 'zero.17',
       'zero.18', '2urvived'],
      dtype='object')

In [20]:
len(titanic_df.columns)

28

In [21]:
titanic_df

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
0,1,22.0,7.2500,0,1,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1,2,38.0,71.2833,1,1,0,0,0,0,0,...,0,0,0,1,0,0,0.0,0,0,1
2,3,26.0,7.9250,1,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,1
3,4,35.0,53.1000,1,1,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,1

In [24]:
titanic_df['2urvived'].head(10)

0    0
1    1
2    1
3    1
4    0
5    0
6    0
7    0
8    1
9    1
Name: 2urvived, dtype: int64

In [29]:
# get list of COLUMNS
titanic_df[['Sex','2urvived']]

      Sex  2urvived
0       0         0
1       1         1
2       1         1
3       1         1
4       0         0
...   ...       ...
1304    0         0
1305    1         0
1306    0         0
1307    0         0
1308    0         0

[1309 rows x 2 columns]

In [34]:
# get list of rows
titanic_df.iloc[[3,5]]

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
3,4,35.0,53.1000,1,1,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,1
5,6,28.0,8.4583,0,0,0,0,0,0,0,...,0,0,0,3,0,0,1.0,0,0,0

In [36]:
# index slicing
titanic_df.iloc[ 3:8 ]

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
3,4,35.0,53.1000,1,1,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,1
4,5,35.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
5,6,28.0,8.4583,0,0,0,0,0,0,0,...,0,0,0,3,0,0,1.0,0,0,0
6,7,54.0,51.8625,0,0,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,0
7,8,2.0,21.0750,0,3,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0

In [39]:
titanic_df.loc[7, 'sibsp']

3

In [38]:
titanic_df.loc[:,'Passengerid':'zero']

      Passengerid   Age      Fare  Sex  sibsp  zero
0               1  22.0    7.2500    0      1     0
1               2  38.0   71.2833    1      1     0
2               3  26.0    7.9250    1      0     0
3               4  35.0   53.1000    1      1     0
4               5  35.0    8.0500    0      0     0
...           ...   ...       ...  ...    ...   ...
1304         1305  28.0    8.0500    0      0     0
1305         1306  39.0  108.9000    1      0     0
1306         1307  38.5    7.2500    0      0     0
1307         1308  28.0    8.0500    0      0     0
1308         1309  28.0   22.3583    0      1     0

[1309 rows x 6 columns]

In [48]:
titanic_df.loc[5:10, 'Passengerid':'zero']

    Passengerid   Age     Fare  Sex  sibsp  zero
5             6  28.0   8.4583    0      0     0
6             7  54.0  51.8625    0      0     0
7             8   2.0  21.0750    0      3     0
8             9  27.0  11.1333    1      0     0
9            10  14.0  30.0708    1      1     0
10           11   4.0  16.7000    1      1     0

In [49]:
# # TODO: numpay array simple indexing
# l = [1,2,3,4,5,6,7]
# l[ 3:6 ]


# l[ [3,6] ]

In [50]:
titanic_df.shape

(1309, 28)

In [54]:
titanic_df.describe()

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
count,1309.000000,1309.000000,1309.000000,1309.000000,1309.000000,1309.0,1309.0,1309.0,1309.0,1309.0,...,1309.0,1309.0,1309.0,1309.000000,1309.0,1309.0,1307.000000,1309.0,1309.0,1309.000000
mean,655.000000,29.503186,33.281086,0.355997,0.498854,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,2.294882,0.0,0.0,1.492731,0.0,0.0,0.261268
std,378.020061,12.905241,51.741500,0.478997,1.041658,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.837836,0.0,0.0,0.814626,0.0,0.0,0.439494
min,1.000000,0.170000,0.000000,0.000000,0.000000,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,1.000000,0.0,0.0,0.000000,0.0,0.0,0.000000
25%,328.000000,22.000000,7.895800,0.000000,0.000000,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,2.000000,0.0,0.0,1.000000,0.0,0.0,0.000000
50%,655.000000,28.000000,14.454200,0.000000,0.000000,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,3.000000,0.0,0.0,2.000000,0.0,0.0,0.000000
75%,982.000000,35.000000,31.275000,1.000000,1.000000,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,3.000000,0.0,0.0,2.000000,0.0,0.0,1.000000
max,1309.000000,80.000000,512.329200,1.000000,8.000000,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,3.000000,0.0,0.0,2.000000,0.0,0.0,1.000000

In [76]:
numbers_df = pd.read_csv('../../datasets/numbers_demo_2.csv', 
             header=None, 
             delimiter=';')

In [75]:
numbers_df

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [78]:
# get slice of [11,12], [15,16]
numbers_df.loc[ 2:3, 2:3 ]

    2   3
2  11  12
3  15  16

In [83]:
numbers_df.loc[ [0,3] , [0,3] ]

    0   3
0   1   4
3  13  16

In [86]:
numbers_df.loc[0:0, [0,3] ]

   0  3
0  1  4

In [88]:
numbers_df_2 = pd.read_csv('../../datasets/numbers_demo_2.csv', 
             header=None, 
             delimiter=';',
             names=['A', 'B', 'C', 'D'])
numbers_df_2

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [92]:
numbers_df_2.loc[ [0,3] , ['A','D'] ]

    A   D
0   1   4
3  13  16

In [116]:
numbers_df_3 = pd.read_csv('../../datasets/numbers_demo_2.csv', 
             header=None, 
             delimiter=';')

numbers_df_3

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [117]:
numbers_df_3.columns = ['A','B','C','D']
numbers_df_3

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [118]:
numbers_df_3.set_index('C')

     A   B   D
C
3    1   2   4
7    5   6   8
11   9  10  12
15  13  14  16

In [122]:
#TODO:
numbers_df_3.reset_index(inplace=True)

In [121]:
numbers_df_3

   index   A   B   C   D
0      0   1   2   3   4
1      1   5   6   7   8
2      2   9  10  11  12
3      3  13  14  15  16

In [127]:
titanic_df.isnull().sum()

Passengerid    0
Age            0
Fare           0
Sex            0
sibsp          0
zero           0
zero.1         0
zero.2         0
zero.3         0
zero.4         0
zero.5         0
zero.6         0
Parch          0
zero.7         0
zero.8         0
zero.9         0
zero.10        0
zero.11        0
zero.12        0
zero.13        0
zero.14        0
Pclass         0
zero.15        0
zero.16        0
Embarked       2
zero.17        0
zero.18        0
2urvived       0
dtype: int64

In [128]:
# from multi dimensional nddarray
ndarr = np.arange(1,7).reshape(3,2)
print(ndarr)

df_arr = pd.DataFrame(ndarr, index=['row1','row2','row3'],columns=['col1', 'col2'])
df_arr

[[1 2]
 [3 4]
 [5 6]]

      col1  col2
row1     1     2
row2     3     4
row3     5     6

In [130]:
numbers_df

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [133]:
# TODO:
numbers_df['New'] = [1, None*1000, 10001]
numbers_df

NameError: name 'NaN' is not defined